colocation/ref-results/pgbench-10_removeDuplicates/pgbench-10.txt
pgbench (17.2 (Debian 17.2-1.pgdg120+1))
starting vacuum...end.
transaction type: <builtin: select only>
scaling factor: 1000
query mode: simple
number of clients: 10
number of threads: 6
maximum number of tries: 1
duration: 250 s
number of transactions actually processed: 33820382
number of failed transactions: 0 (0.000%)
latency average = 0.074 ms
initial connection time = 7.000 ms
tps = 135285.150936 (without initial connection time)
statement latencies in milliseconds and failures:
         0.001           0  \set aid random(1, 100000 * :scale)
         0.073           0  SELECT abalance FROM pgbench_accounts WHERE aid = :aid;